# Rebar Set Bar Included Method

Source: https://www.revitapidocs.com/2026/b6bd8b08-36ab-ec51-a533-8c918b2fe42c.htm

---

| Rebar Set Bar Included Method |
| --- |

Sets if the bar at the desired index is included or not.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public void SetBarIncluded(
	bool include,
	int barPositionIndex
)
```

```
Public Sub SetBarIncluded (
	include As Boolean,
	barPositionIndex As Integer
)
```

```
public:
void SetBarIncluded(
	bool include,
	int barPositionIndex
)
```

```
member SetBarIncluded :
        include : bool *
        barPositionIndex : int -> unit
```

#### Parameters

include Boolean
:   True to include the bar, false to exclude the bar.

barPositionIndex Int32
:   The bar index.

Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | barPositionIndex should be in range \[ 0, NumberOfBarPositions\-1 ] and the bar at barPositionIndex should be included. |

See Also

#### Reference

Rebar Class Autodesk.Revit.DB.Structure Namespace